# 序列：内容连续，有序，可使用下标索引的一类数据容器
# 列表 元组 字符串都是序列
# 切片：从一个序列中，取出一个子序列
# 语法：序列[起始下标:结束下标:步长]
# 起始下标可以留空，表示从头开始
# 结束下标留空表示截取到结尾
# 步长表示取元素的间隔 步长可以为负，表示从尾向头按步长的绝对值取 步长可以不写，默认是1
L =  [0,1,2,3,4,5,6]
result = L[1:4] # 步长可以不写，默认是1
print(f"结果1：{result}")

t = (0,1,2,3,4,5,6)
result2 = t[:] # 起始和结束不写表示从头到尾，步长1可以省略
print(f"结果2：{result2}")

str = "0123456"
result3 = str[::2]
print(f"结果3:{result3}")
result4 = str[::-1] # 等同于反转操作
print(f"结果4：{result4}")

my_list = [0,1,2,3,4,5,6]
result5 = my_list[3:1:-1]
print(f"结果5：{result5}")

my_tuple = (0,1,2,3,4,5,6)
result6 = my_tuple[::-2]
print(f"结果6：{result6}")

# 案例
anli = "万过月薪，员序程马黑来，nohtyp学"
daoxu = anli[::-1][9:14]
print(f"{daoxu}")